MAX_n = 30 

n = int(input())

# n는 짝수 여야한다.

dp = [0,0,3,0,(3*3) + (2*1)] + [0 for i in range(n-4)]
#0,0,3,0,11,0,41,0,153

dp_2 = [0,1,2] + [0 for i in range(n-2)]
for i in range(3,n+1):
    dp_2[i] = dp_2[i-1] + dp_2[i-2]
# 0,1,2,3,5,8,13,21,34

print(dp_2)

# 짝수 일때마다 양 끝에 1 dp_2[n-2] 1을 세우는 방식은 항상 추가

# 6 이상의 짝수에  dp_2[n-1] l (* 2)가능 - 11



ㅣㅣ -  -
 - ㅣㅣ =   *  dp[n-3]

+ dp_2[n-1] - dp_2[n-2] = 2 


dp_2[n-1] l - dp_2[n-2] ll + = dp_2[n-5] =l   = 8 - 5 + 1
# dp[8] = 21 - 13 + 3 = 14


# 6
1=1=  x  
1==1
1=111

1==1  x
=1=1  x(o)
111=1

   =1







(2 *)    =l * dp_2[n-3] #2  6  16

(2 *) l=   * dp_2[n-3]   #2  6  16

- (2 *) l dp_2[n-4] =l   #2  4  10
  
- (2 *) l= dp_2[n-4] l   #2  4  10

+ (2 *) l= dp_2[n_6] =l  #2  2  4

                         #2  6


dp[6] = 33 + 6 + 6 - 0




for i in range(6,n+1,2):
    dp[i] = dp[i-2] * 3       # 마지막에 dp_2[i-2]-1에서 -1는 11111

# 9 + 2
# 33 + 8 = 41
# 123 + 30 = 153
# 459 + 112 = 571

print(dp)

print(dp[n])
